languageData = {
    armenian: {
        cameral: true,
        quote: true,
        keyboardDimensions: 1,
        alphabet: {
            "ա":"a",
            "բ":"b",
            "գ":"g",
            "դ":"d",
            "ե":"ye,e",
            "զ":"z",
            "է":"e",
            "ը":"ə",
            "թ":"t'",
            "ժ":"ž",
            "ի":"i",
            "լ":"l",
            "խ":"x",
            "ծ":"c",
            "կ":"k",
            "հ":"h",
            "ձ":"j",
            "ղ":"ł",
            "ճ":"č",
            "մ":"m",
            "յ":"j",
            "ն":"n",
            "շ":"š",
            "ո":"vo,o",
            "չ":"č'",
            "պ":"p",
            "ջ":"ǰ",
            "ռ":"ṙ",
            "ս":"s",
            "վ":"v",
            "տ":"t",
            "ր":"r",
            "ց":"c'",
            "փ":"p",
            "ք":"k",
            "և":"yev,ev",
            "օ":"ō",
            "ֆ":"f",
            "ու": "u",
        },
        toIPA: {
            "a": "ɑ",
            "e": "ɛ",
            "o": "ɔ",
            "ō": "o",
            "ye": "je",
            "yev":"jev",
            "ev": "ev",
            "ž": "ʒ",
            "c": "ts",
            "j": "dz",
            "ł": "ʁ",
            "č": "tʃ",
            "t'": "tʰ",
            "č'": "tʃʰ",
            "c'": "tsʰ",
            "p'": "pʰ",
            "k'": "kʰ",
            "ǰ": "dʒ",
            "š": "ʃ",
            "ṙ": "r",
            "r": "ɾ",
            "x": "χ",
        },
        latinKeyboard: ["č", "ə", "ǰ", "ł", "ō", "ṙ", "š", "ž"],
        nativeKeyboard: {
            "Digit2": "ձ",
            "Digit3": "յ",
            "Digit0": "օ",
            "Minus": "ռ",
            "Equal": "ժ",
            "KeyQ": "խ",
            "KeyW": "ւ",
            "KeyE": "է",
            "KeyR": "ր",
            "KeyT": "տ",
            "KeyY": "ե",
            "KeyU": "ը",
            "KeyI": "ի",
            "KeyO": "ո",
            "KeyP": "պ",
            "BracketLeft": "չ",
            "BracketRight": "ջ",
            "KeyA": "ա",
            "KeyS": "ս",
            "KeyD": "դ",
            "KeyF": "ֆ",
            "KeyG": "ք",
            "KeyH": "հ",
            "KeyJ": "ճ",
            "KeyK": "կ",
            "KeyL": "լ",
            "Semicolon": "թ",
            "Quote": "փ",
            "KeyZ": "զ",
            "KeyX": "ց",
            "KeyC": "գ",
            "KeyV": "վ",
            "KeyB": "բ",
            "KeyN": "ն",
            "KeyM": "մ",
        },
        plan: [
            [   //lesson1
                "i:Welcome to the lesson, we are going to be learning the Eastern dialect of Armenian.", //i=>info
                "l:ր", //l=>letter
                "t:ր",
                "l:օ",
                "t:Երևան",
                "t:օր", //t=>translit
                "t:or", //t=>translit
                "c:ջ>ՉՋԶ", //capital/lower
                "d:Ամերիկա>America", //d=>definition
            ],
            [ 'l:օ', 'l:ր', 't:օր' ],
            [ 'l:պ', 'l:ե', 'l:կ', 't:րոպե', 't:երեկ' ],
            [
              'l:և',     'l:վ',
              'l:ա',     'l:բ',
              'l:ի',     't:վերև',
              't:բիբար', 't:բարև'
            ],
            [ 'l:ը', 'l:ն', 'l:զ', 't:ինը', 't:զրո' ],
            [
              'l:ու',    'l:թ',
              'l:ո',     'l:յ',
              't:երկու', 't:ութ',
              't:այո'
            ],
            [ 'l:տ', 'l:ս', 'l:շ', 't:տասներկու', 't:շատ', 't:տասնյոթ' ],
            [ 'l:է', 'l:գ', 'l:դ', 't:դաշտէ', 't:գիշեր', 't:օդակայան' ],
            [ 'l:ժ', 'l:լ', 'l:խ', 't:տեսարժան', 't:լոգարան', 't:խոզանակ' ],
            [ 'l:ծ', 'l:հ', 'l:ձ', 't:վիրավորված', 't:հանգիստ', 't:ձուկ' ],
            [
              'l:ղ',
              'l:ճ',
              'l:մ',
              't:մակարոնեղեն',
              't:նախաճաշ',
              't:մրսածության'
            ],
            [
              'l:չ',
              'l:ջ',
              'l:ռ',
              'l:ց',
              't:տասնչորս',
              't:նարնջագույն',
              't:ռեստորաններ',
              't:հեռուստացույց'
            ],
            [ 'l:փ', 'l:ք', 'l:ֆ', 't:փողոց', 't:ընթրիք', 't:ֆունտեր' ],
        ],
    },
    greek: {
        cameral: true,
        quote: false,
        keyboardDimensions: 1,
        alphabet: {
            "α": "a",
            "β": "v",
            "γ": "g,y",
            "δ": "dh",
            "ε": "e",
            "ζ": "z",
            "η": "i",
            "θ": "th",
            "ι": "i",
            "κ": "k",
            "λ": "l",
            "μ": "m",
            "ν": "n",
            "ξ": "ks",
            "ο": "o",
            "π": "p",
            "ρ": "r",
            "σ": "s",
            "ς": "s",
            "τ": "t",
            "υ": "y",
            "φ": "f",
            "χ": "ch",
            "ψ": "ps",
            "ω": "o",
            "ει": "i",
            "οι": "i",
            "υι": "i",
            "αι": "e",
            "ου": "u",
            "αυ": "av,af",
            "ευ": "ev,ef",
            "μπ": "b,mb",
            "ντ": "d,nd",
            "τζ": "dz",
            "γγ": "ng",
            "γκ": "gk,ng",
        },
        toIPA: {
            "gk": "g",
            "g": "ɣ",
            "a": "ɑ",
            "e": "ɛ",
            "ch": "χ",
            "ng": "ŋ",
            "dh": "ð",
            "th": "θ",
            "y": "j",
        },
        latinKeyboard: [], //none
        nativeKeyboard: {
            "KeyW": "ς",
            "KeyE": "ε",
            "KeyR": "ρ",
            "KeyT": "τ",
            "KeyY": "υ",
            "KeyU": "θ",
            "KeyI": "ι",
            "KeyO": "ο",
            "KeyP": "π",
            "KeyA": "α",
            "KeyS": "σ",
            "KeyD": "δ",
            "KeyF": "φ",
            "KeyG": "γ",
            "KeyH": "η",
            "KeyJ": "ξ",
            "KeyK": "κ",
            "KeyL": "λ",
            "KeyZ": "ζ",
            "KeyX": "χ",
            "KeyC": "ψ",
            "KeyV": "ω",
            "KeyB": "β",
            "KeyN": "ν",
            "KeyM": "μ",
        },
        plan: [
            [ 'l:ν', 'l:β', 'l:ρ', 'l:α', 'l:ι', 't:Ιράν' ],
            [ 'l:ς', 'l:λ', 'l:φ', 'l:κ', 'l:ε', 't:Σλοβενία', 't:Καλιφόρνια' ],
            [
              'l:η',        'l:ο',
              'l:ω',        'l:δ',
              'l:π',        'l:τ',
              't:Νεβάδα',   't:Κόστα Ρίκα',
              't:Πακιστάν', 't:Περσεφόνη'
            ],
            [ 'l:μ', 'l:ξ', 'l:υ', 'l:γ', 't:ξενοφοβία', 't:Τελ Αβίβ' ],
            [
              'l:γ',
              'l:ζ',
              'l:θ',
              'l:χ',
              't:καλλιγραφία',
              't:Μεξικό',
              't:Θεσσαλονίκη'
            ],
            [
              'l:αι',
              'l:ει',
              'l:οι',
              'l:υι',
              'l:ου',
              't:Αλεξάνδρεια',
              't:Παραγουάη',
              't:Σωκράτης'
            ],
            [
              'l:μπ',
              'l:ντ',
              'l:τζ',
              'l:γγ',
              't:Τζόρτζια',
              't:Μπουτάν',
              't:Τζαμάικα'
            ],
            [
              'l:αυ',
              'l:ευ',
              'l:γκ',
              't:αυτοκινητόδρομος',
              't:κοινοβουλευτικός',
              't:Ανγκόλα'
            ]
          ],
    },
    russian: {
        cameral: true,
        quote: false,
        keyboardDimensions: 1,
        alphabet: { 
            "а": "a", 
            "б": "b", 
            "в": "v", 
            "г": "g", 
            "д": "d", 
            "е": "ie,e", 
            "ё": "io,o", 
            "ж": "zh", 
            "з": "z", 
            "и": "i", 
            "й": "i", 
            "к": "k", 
            "л": "l", 
            "м": "m", 
            "н": "n", 
            "о": "o", 
            "п": "p", 
            "р": "r",
            "с": "s", 
            "т": "t", 
            "у": "u", 
            "ф": "f", 
            "х": "kh",
            "ц": "ts",
            "ч": "ch", 
            "ш": "sh", 
            "щ": "shch", 
            "ъ": `"`,
            "ы": "y",
            "ь": "'",
            "э": "e",
            "ю": "iu,u", 
            "я": "ia,a",
        }, 
        toIPA: {
            "y": "ɨ",
            "'": "",
            "\"": "",
            "zh": "ʒ",
            "sh": "ʂ",
            "shch": "ɕ",
            "ch": "tʃ",
            "kh": "χ",
            "a": "ɑ",
            "e": "ɛ",
            "iu": "ju",
            "ia": "ja",
            "io": "jo",
            "ie": "je",
        },
        latinKeyboard: [], //none
        nativeKeyboard: {
            "KeyQ": "й",
            "KeyW": "ц",
            "KeyE": "у",
            "KeyR": "к",
            "KeyT": "е",
            "KeyY": "н",
            "KeyU": "г",
            "KeyI": "ш",
            "KeyO": "щ",
            "KeyP": "з",
            "BracketLeft": "х",
            "BracketRight": "ъ",
            "Backslash": "ё",
            "KeyA": "ф",
            "KeyS": "ы",
            "KeyD": "в",
            "KeyF": "а",
            "KeyG": "п",
            "KeyH": "р",
            "KeyJ": "о",
            "KeyK": "л",
            "KeyL": "д",
            "Semicolon": "ж",
            "Quote": "э",
            "KeyZ": "я",
            "KeyX": "ч",
            "KeyC": "с",
            "KeyV": "м",
            "KeyB": "и",
            "KeyN": "т",
            "KeyM": "ь",
            "Comma": "б",
            "Period": "ю",
        },
        plan: [
            [
              'l:а',
              'l:к',
              'l:м',
              'l:о',
              'l:с',
              'l:т',
              't:кокос',
              't:там',
              't:моток'
            ],
            [
              'l:в',
              'l:е',
              'l:н',
              'l:р',
              'l:х',
              'l:б',
              't:нет',
              't:место',
              't:работа',
              't:москва',
              't:страх'
            ],
            [
              'l:и',
              'l:г',
              'l:д',
              'l:л',
              'l:п',
              'l:у',
              't:рука',
              't:где',
              't:подумала',
              't:минута',
            ],
            [
              'l:й',
              'l:з',
              'l:ж',
              'l:ч',
              'l:ц',
              'l:э',
              't:другой',
              't:сразу',
              't:мужчина',
              't:конец',
              't:экономический'
            ],
            [
              'l:ё',
              'l:я',
              'l:ю',         'l:ш',
              'l:щ',         'l:ы',
              't:чёрный',    't:хозяин',
              't:следующий', 't:пришлый'
            ],
            [ 'l:ф', 'l:ь', 'l:ъ', 't:объяснить', 't:вздохнуть', 't:информация' ]
        ],
    },
    bulgarian: {
        cameral: true,
        quote: false,
        keyboardDimensions: 1,
        alphabet: { 
            "а": "a", 
            "б": "b", 
            "в": "v", 
            "г": "g", 
            "д": "d", 
            "е": "e", 
            "ж": "zh", 
            "з": "z", 
            "и": "i", 
            "й": "y", 
            "к": "k", 
            "л": "l", 
            "м": "m", 
            "н": "n", 
            "о": "o", 
            "п": "p", 
            "р": "r",
            "с": "s", 
            "т": "t", 
            "у": "u", 
            "ф": "f", 
            "х": "kh",
            "ц": "ts", 
            "ч": "ch", 
            "ш": "sh", 
            "щ": "sht", 
            "ъ": "ŭ", 
            "ы": "y", 
            "ь": "'", 
            "э": "e", 
            "ю": "yu", 
            "я": "ya",
        }, 
        toIPA: {
            "y": "j",
            "'": "",
            "ŭ": "ɤ",
            "zh": "ʒ",
            "sh": "ʃ",
            "sht": "ʃt",
            "ch": "tʃ",
            "kh": "χ",
            "a": "ɑ",
            "e": "ɛ",
            "yu": "ju",
            "ya": "ja",
        },
        latinKeyboard: ["ŭ"],
        nativeKeyboard: {
            "KeyW": "у",
            "KeyE": "е",
            "KeyR": "и",
            "KeyT": "ш",
            "KeyY": "щ",
            "KeyU": "к",
            "KeyI": "с",
            "KeyO": "д",
            "KeyP": "з",
            "BracketLeft": "ц",
            "KeyA": "ь",
            "KeyS": "я",
            "KeyD": "а",
            "KeyF": "о",
            "KeyG": "ж",
            "KeyH": "г",
            "KeyJ": "т",
            "KeyK": "н",
            "KeyL": "в",
            "Semicolon": "м",
            "Quote": "ч",
            "KeyZ": "ю",
            "KeyX": "й",
            "KeyC": "ъ",
            "KeyV": "э",
            "KeyB": "ф",
            "KeyN": "х",
            "KeyM": "п",
            "Comma": "р",
            "Period": "л",
            "Slash": "б",
        },
        plan: [
            [
              'l:а',     'l:к',
              'l:м',     'l:о',
              'l:р',     'l:т',
              't:какао', 't:там',
              't:мотор'
            ],
            [
              'l:в',      'l:е',
              'l:н',      'l:х',
              'l:б',      'l:с',
              't:не',     't:работа',
              't:москва', 't:страх'
            ],
            [
              'l:и',      'l:г',
              'l:д',      'l:л',
              'l:п',      'l:у',
              'l:ъ',      't:ръка',
              't:където', 't:мисъл',
              't:минута'
            ],
            [
              'l:й',
              'l:з',
              'l:ж',
              'l:ч',
              'l:ц',
              't:незабавно',
              't:мъжът',
              't:икономически'
            ],
            [
              'l:я',
              'l:ю',
              'l:ш',
              'l:щ',
              'l:ф',
              'l:ь',
              't:юли',
              't:обясни',
              't:въздишка',
              't:инфраструктура'
            ]
          ],
    },
    tamazight: {
        cameral: false,
        quote: false,
        keyboardDimensions: 2,
        alphabet: {
            "ⴰ": "a",
            "ⴱ": "b",
            "ⴳ": "g",
            "ⴷ": "d",
            "ⴹ": "ḍ",
            "ⴻ": "e",
            "ⴼ": "f",
            "ⴽ": "k",
            "ⵀ": "h",
            "ⵃ": "ḥ",
            "ⵄ": "'",
            "ⵅ": "kh",
            "ⵇ": "q",
            "ⵉ": "i",
            "ⵊ": "j",
            "ⵍ": "l",
            "ⵎ": "m",
            "ⵏ": "n",
            "ⵓ": "u",
            "ⵔ": "r",
            "ⵕ": "ṛ",
            "ⵖ": "gh",
            "ⵙ": "s",
            "ⵚ": "ṣ",
            "ⵛ": "sh",
            "ⵜ": "t",
            "ⵟ": "ṭ",
            "ⵡ": "w",
            "ⵢ": "y",
            "ⵣ": "z",
            "ⵥ": "ẓ",
            "ⵯ": "ʷ",
        },
        toIPA: {
            "a": "æ",
            "e": "ə",
            "u": "ʊ",
            "ḍ": "dˤ",
            "ḥ": "ħ",
            "ṛ": "rˤ",
            "ṣ": "sˤ",
            "ṭ": "tˤ",
            "ẓ": "zˤ",
            "'": "ʕ",
            "gh": "ɣ",
            "j": "ʒ",
            "kh": "χ",
            "sh": "ʃ",
            "ʷ": "w",
            "y": "j",
        },
        latinKeyboard: ["ḍ", "ḥ", "ṛ", "ṣ", "ṭ", "ẓ", "ʷ"],
        nativeKeyboard: {
            "KeyQ": "ⴰ",
            "KeyW": "ⵣ",
            "KeyE": "ⴻ",
            "KeyR": "ⵔ",
            "KeyT": "ⵜ",
            "KeyY": "ⵢ",
            "KeyU": "ⵓ",
            "KeyI": "ⵉ",
            "KeyO": "ⵄ",
            "KeyA": "ⵇ",
            "KeyS": "ⵙ",
            "KeyD": "ⴷ",
            "KeyF": "ⴼ",
            "KeyG": "ⴳ",
            "KeyH": "ⵀ",
            "KeyJ": "ⵊ",
            "KeyK": "ⴽ",
            "KeyL": "ⵍ",
            "Semicolon": "ⵎ",
            "KeyZ": "ⵡ",
            "KeyX": "ⵅ",
            "KeyC": "ⵛ",
            "KeyV": "ⵯ",
            "KeyB": "ⴱ",
            "KeyN": "ⵏ",
            "KeyM": "ⵖ",
        },
        secondaryKeyboard: {
            "KeyR": "ⵕ",
            "KeyT": "ⵟ",
            "KeyS": "ⵚ",
            "KeyD": "ⴹ",
            "KeyH": "ⵃ",
            "KeyZ": "ⵥ",
            //
        },
        plan: [
            [ 'l:ⴰ', 'l:ⵣ', 'l:ⵓ', 'l:ⵍ', 't:ⴰⵣⵓⵍ' ],
            [ 'l:ⵔ', 'l:ⵎ', 'l:ⵜ', 't:ⴰⵣⵣⴰⵔ', 't:ⴰⵔⴰⵎ', 't:ⵜⴰⵎⴰⵔⵜ' ],
            [ 'l:ⴱ', 'l:ⵙ', 'l:ⵉ', 't:ⴱⴰⵍⵎⴰ', 't:ⵙⵎⵎⵓⵙ', 't:ⵜⵓⵔⵜⵉⵜ' ],
            [ 'l:ⵡ', 'l:ⵛ', 't:ⵜⵉⵣⵉⵣⵡⵉⵜ', 't:ⵜⴰⵛⵛⵍⵜ' ],
            [ 'l:ⴳ', 'l:ⴷ', 'l:ⴹ', 't:ⵉⴳⵔ', 't:ⵜⵓⴳⴷⵓⵜ', 't:ⴰⴳⴹⵉⴹ' ],
            [ 'l:ⴼ', 'l:ⴽ', 'l:ⵀ', 't:ⴰⴼⴰⵍⴽⵓ', 't:ⵜⵉⴷⴷⵓⴽⴽⵍⴰ', 't:ⴰⵎⵀⴰⴷ' ],
            [ 'l:ⵃ', 'l:ⵄ', 'l:ⵅ', 't:ⴰⵃⵉⴷⵓⵙ', 't:ⴰⵄⵔⴰⴱ', 't:ⵉⵅⴼ' ],
            [ 'l:ⴻ', 'l:ⵇ', 'l:ⵊ', 't:ⵜⴰⵎⴻⴷⴷⵉⵜ', 't:ⴰⵇⵛⵎⵉⵔ', 't:ⴰⵊⴷⴷⵉⴳ' ],
            [ 'l:ⵏ', 'l:ⵕ', 'l:ⵖ', 't:ⵜⴰⴼⵓⵏⴰⵙⵜ', 't:ⴽⵕⴰⴹ', 't:ⵜⴰⵎⴰⵣⵉⵖⵜ' ],
            [ 'l:ⵚ', 'l:ⵟ', 'l:ⵢ', 't:ⵙⴹⵉⵚ', 't:ⵜⵉⵟⵟⴰⵡⵉⵏ', 't:ⵜⴰⵢⵔⵉ' ],
            [ 'l:ⵥ', 'l:ⵯ', 't:ⵉⵕⵥⵥⵉ', 't:ⴰⵎⴷⴷⴰⴽⴽⵯⵍ', 't:ⵜⵉⵍⴳⴳⵯⵉⵜ' ]
        ],
    },
    georgian: {
        keyboardDimensions: 2,
        cameral: false,
        quote: true,
        alphabet: {
            "ა": "a",
            "ბ": "b",
            "გ": "g",
            "დ": "d",
            "ე": "e",
            "ვ": "v",
            "ზ": "z",
            "თ": "t",
            "ი": "i",
            "კ": "k'",
            "ლ": "l",
            "მ": "m",
            "ნ": "n",
            "ო": "o",
            "პ": "p'",
            "ჟ": "zh",
            "რ": "r",
            "ს": "s",
            "ტ": "t'",
            "უ": "u",
            "ფ": "p",
            "ქ": "k",
            "ღ": "gh",
            "ყ": "q'",
            "შ": "sh",
            "ჩ": "ch",
            "ც": "ts",
            "ძ": "dz",
            "წ": "ts'",
            "ჭ": "ch'",
            "ხ": "kh",
            "ჯ": "j",
            "ჰ": "h",
        },
        toIPA: {
            "zh": "ʒ",
            "gh": "ʁ",
            "sh": "ʃ",
            "ch": "tʃ",
            "ch'": "tʃ'",
            "kh": "χ",
            "j": "dʒ",
            "a": "ɑ",
            "e": "ɛ",
            "o": "ɔ",
        },
        latinKeyboard: [], //done
        nativeKeyboard: {
            "KeyQ": "ქ",
            "KeyW": "წ",
            "KeyE": "ე",
            "KeyR": "რ",
            "KeyT": "ტ",
            "KeyY": "ყ",
            "KeyU": "უ",
            "KeyI": "ი",
            "KeyO": "ო",
            "KeyP": "პ",
            "KeyA": "ა",
            "KeyS": "ს",
            "KeyD": "დ",
            "KeyF": "ფ",
            "KeyG": "გ",
            "KeyH": "ჰ",
            "KeyJ": "ჯ",
            "KeyK": "კ",
            "KeyL": "ლ",
            "KeyZ": "ზ",
            "KeyX": "ხ",
            "KeyC": "ც",
            "KeyV": "ვ",
            "KeyB": "ბ",
            "KeyN": "ნ",
            "KeyM": "მ",
        },
        secondaryKeyboard: {
            "KeyW": "ჭ",
            "KeyR": "ღ",
            "KeyT": "თ",
            "KeyS": "შ",
            "KeyJ": "ჟ",
            "KeyZ": "ძ",
            "KeyC": "ჩ",
        },
        plan: [
            [ 'i:Welcome to the course, get ready to learn Georgian! Remember, Georgian has no uppercase and lowercase letters, there is just one case.', 'l:ა', 'l:თ', 'l:ი', 't:ათი' ],
            [ 'l:ე', 'l:რ', 'l:მ', 't:არა', 't:mere', 't:მთა' ],
            [ 'l:ბ', 'l:გ', 'l:ო', 't:ori', 't:ერთი' ],
            [ 'l:დ', 'l:ჯ', 'l:ს', 't:სად', 't:გამარჯობა' ],
            [ 'l:ლ', 'l:უ', 'l:ქ', 't:ქართული', 't:გმადლობთ', 't:madloba' ],
            [ 'l:ხ', 'l:ფ', 'l:ნ', 't:დამეხმარეთ', 't:ფრთხილად', 't:ინგლისური' ],
            [ 'l:შ', 'l:ვ', 'l:ც', 't:შორის', 't:მარცხნივ', 't:მარჯვნივ' ],
            [
              'l:ჰ',
              'l:ძ',
              'l:ჩ',
              't:ჰაეროვნება',
              't:ბრძანდებით',
              't:ჩრდილოეთი'
            ],
            [ 'l:ღ', 'l:ჟ', 'l:ზ', 't:აღმოსავლეთი', 't:ამჟამად', 't:საზღვარი' ],
            [ 'l:პ', 'l:კ', 'l:ტ', 't:პარასკევი', 't:დეკემბერი', 't:აეროპორტი' ],
            [ 'l:ყ', 'l:წ', 'l:ჭ', 't:ყურძენი', 't:წყალი', 't:ჭიანჭველასებრნი' ]
          ]
    },
    /*
    yiddish: {
        keyboardDimensions: 1,
        cameral: false,
        quote: false,
        alphabet: { //incomplete
            "ו": "u",
            "ײַ": "ey",
            "וו": "v",
            "וי": "oy",
            "דזש": "dzh",
            "זש": "zh",
            "טש": "tsh",
            "ייִ": "yi",
            "יי": "ay",
            "אַ": "a",
            "אָ": "o",
            "ב": "v",
            "ג": "g",
            "ד": "d",
            "ה": "h",
            "ז": "z",
            "ח": "ch",
            "ט": "t",
            "י": "y,i",
            "כ": "ch",
            "ך": "ch",
            "ל": "l",
            "מ": "m",
            "ם": "m",
            "נ": "n",
            "ן": "n",
            "ס": "s",
            "ע": "e",
            "פֿ": "f",
            "ף": "f",
            "פּ": "p",
            "צ": "tz",
            "ץ": "tz",
            "ק": "k",
            "ר": "r",
            "ת": "t",
            "ו": "u",
            "ש": "sh",
        },
        toIPA: {
          "tsh": "tʃ",
          "tz": "ts",
          "ch": "χ",
          "sh": "ʃ",
          "a": "ɑ",
          "e": "ɛ",
          "y": "j",
          "oy": "oj",
          "zh": "ʒ",
          "dzh": "dʒ",
        }, //
        latinKeyboard: [], //none
        nativeKeyboard: {
    "KeyQ": "ך",
    "KeyW": "ש",
    "KeyE": "ע",
    "KeyR": "ר",
    "KeyT": "ט",
    "KeyY": "י",
    "KeyU": "ו",
    "KeyI": "יִ",
    "KeyO": "אָ",
    "KeyP": "פ",
    "KeyA": "אַ",
    "KeyS": "ס",
    "KeyD": "ד",
    "KeyF": "פֿ",
    "KeyG": "ג",
    "KeyH": "ה",
    "KeyJ": "ײַ",
    "KeyK": "ק",
    "KeyL": "ל",
    "Semicolon": "ף",
    "KeyZ": "ז",
    "KeyX": "כ",
    "KeyC": "צ",
    "KeyV": "ץ",
    "KeyB": "ב",
    "KeyN": "נ",
    "KeyM": "מ",
    "Comma": "ם",
    "Period": "ן",
    "Slash": "וּ",
        },
        plan: [
            [],
            [],
            [],
            [],
        ],
    },
    */
    hebrew: {
        keyboardDimensions: 1,
        cameral: false,
        quote: false,
        alphabet: { //may need revision
            "א": "",
            "בּ": "b",
            "ב": "v",
            "ג": "g",
            "ד": "d",
            "ה": "h",
            "ז": "z",
            "ח": "ch",
            "ט": "t",
            "י": "y",
            "כּ": "k",
            "כ": "ch",
            "ך": "ch",
            "ל": "l",
            "מ": "m",
            "ם": "m",
            "נ": "n",
            "ן": "n",
            "ס": "s",
            "ע": "",
            "פּ": "p",
            "פ": "f",
            "ף": "f",
            "צ": "tz",
            "ץ": "tz",
            "ק": "k",
            "ר": "r",
            "שׁ": "sh",
            "שׂ": "s",
            "ת": "t",
            "וּ": "u",
            "וֹ": "o",
            "ו": "v",
            "ְX": "",
            "ֱX": "e",
            "ֲX": "a",
            "ֳX": "o",
            "ִX": "i",
            "ֵX": "e",
            "ֶX": "e",
            "ַX": "a",
            "ָX": "a",
            "ֻX": "u",
            "ֹX": "o",
        },
        toIPA: {
            "tz": "ts",
            "ch": "χ",
            "sh": "ʃ",
            "a": "ɑ",
            "e": "ɛ",
            "y": "j",
        },
        latinKeyboard: [], //none
        nativeKeyboard: {
            "KeyE": "ק",
            "KeyR": "ר",
            "KeyT": "א",
            "KeyY": "ט",
            "KeyU": "ו",
            "KeyI": "ן",
            "KeyO": "ם",
            "KeyP": "פ",
            "KeyA": "ש",
            "KeyS": "ד",
            "KeyD": "ג",
            "KeyF": "כ",
            "KeyG": "ע",
            "KeyH": "י",
            "KeyJ": "ח",
            "KeyK": "ל",
            "KeyL": "ך",
            "Semicolon": "ף",
            "KeyZ": "ז",
            "KeyX": "ס",
            "KeyC": "ב",
            "KeyV": "ה",
            "KeyB": "נ",
            "KeyN": "מ",
            "KeyM": "צ",
            "Comma": "ת",
            "Period": "ץ",
        },
        plan: [
            [ 'l:ה', 'l:ַX', 'l:ר', 'l:ְX', 't:הַר' ],
            [ 'l:א', 'l:ת', 'l:ָX', 't:אַתְ', 't:אַתָה' ],
            [ 'l:ִX', 'l:בּ', 'l:י', 'l:ד', 't:בַּיִת', 't:יָד' ],
            [ 'l:ֵX', 'l:ל', 'l:ב', 't:תֵל', 't:אָבִיב' ],
            [ 'l:ס', 'l:פ', 'l:נ', 't:סְפָרַד', 't:יַרְדֵן', 't:יָוָן' ],
            [ 'l:וּ', 'l:מ', 'l:צ', 't:סוּרְיָה', 't:מִצְרַיִם' ],
            [ 'l:שׁ', 'l:ט', 'l:ג', 't:יְרוּשָׁלַיִם', 't:אַפְגָנִיסְטָן' ],
            [
              'l:וּ',
              'l:ז',
              'l:פּ',
              't:הוֹדוּ',
              't:בְּרָזִיל',
              't:פִילִיפִּינִים'
            ],
            [
              'l:ו',     'l:ֶX',
              'l:ע',     'l:ק',
              't:טַיְוָן',  't:סֶרְבְּיָה',
              't:עִירַאק'
            ],
            [ 'l:ח', 'l:ֻX', 'l:ֲX', 't:שֻׁלְחַן', 't:אֲסֵפָה' ],
            [
              'l:ֱX',     'l:ֳX',
              'l:ֹX',     't:אֱמֶת',
              't:צִפֳּרִים‎', 't:יַהֲלוֹם',        'l:כ',
              'l:כּ',     'l:שׂ',
              't:כָּחֹל',   't:הֲלָכָה',
              't:יִשְׂרָאֵל'
            ]
        ],
    },
}

/*
`l:а
l:к
l:м
l:о
l:с
l:т
t:кокос
t:там
t:моток

l:в
l:е
l:н
l:р
l:х
l:б
t:нет
t:место
t:работа
t:москва
t:страх

l:и
l:г
l:д
l:л
l:п
l:у
t:рука
t:где
t:подумала
t:минута

l:й
l:з
l:ж
l:ч
l:ц
l:э
t:другой
t:сразу
t:мужчина
t:конец
t:экономический

l:ё
l:я
l:ю
l:ш
l:щ
l:ы
t:чёрный
t:хозяин
t:следующий
t:пришлый

l:ф
l:ь
l:ъ
t:объяснить
t:вздохнуть
t:информация

`l:а
l:к
l:м
l:о
l:р
l:т
t:какао
t:там
t:мотор

l:в
l:е
l:н
l:х
l:б
l:с
t:не
t:работа
t:москва
t:страх

l:и
l:г
l:д
l:л
l:п
l:у
l:ъ
t:ръка
t:където
t:мисъл
t:минута

l:й
l:з
l:ж
l:ч
l:ц
t:незабавно
t:мъжът
t:икономически

l:я
l:ю
l:ш
l:щ
l:ф
l:ь
t:юли
t:обясни
t:въздишка
t:инфраструктура

l:а
l:к
l:м
l:о
l:р
l:т
t:какао
t:тоа
t:мотор
l:в
l:е
l:н
l:х
l:б
l:с
t:не
t:работа
t:москва
t:страх
l:и
l:г
l:д
l:л
l:п
l:у
l:ј
t:утро
t:каде?
t:мисла
t:минута
l:з
l:ж
l:ч
l:ц
l:џ
l:ѕ
t:џенова
t:мажот
t:ѕидот
t:четири
t:македонски
l:ш
l:ф
l:ќ
l:ѓ
l:њ
l:љ
t:формирањето
t:комунистичка партија
t:виљушка
t:меѓународната
l:а
l:к
l:м
l:о
l:р
l:т
t:какао
t:мотор
l:в
l:е
l:н
l:х
l:б
l:с
t:не
t:работа
t:страх
l:и
l:г
l:д
l:л
l:п
l:у
t:дан
t:где?
t:мислио
t:радити
l:з
l:ж
l:ч
l:ц
l:џ
l:ј
t:санџак
t:народноослободилачки
t:југославија
l:ш
l:ф
l:ћ
l:ђ
l:њ
l:љ
t:ђенова
t:оснивање
t:федерација
t:најзаступљеније

`l:ν
l:β
l:ρ
l:α
l:ι
t:Ιράν

l:ς
l:λ
l:φ
l:κ
l:ε
t:Σλοβενία
t:Καλιφόρνια

l:η
l:ο
l:ω
l:δ
l:π
l:τ
t:Νεβάδα
t:Κόστα Ρίκα
t:Πακιστάν
t:Περσεφόνη

l:μ
l:ξ
l:υ
l:γ
t:ξενοφοβία
t:Τελ Αβίβ

l:γ
l:ζ
l:θ
l:χ
t:καλλιγραφία
t:Μεξικό
t:Θεσσαλονίκη

l:αι
l:ει
l:οι
l:υι
l:ου
t:Αλεξάνδρεια
t:Παραγουάη
t:Σωκράτης

l:μπ
l:ντ
l:τζ
l:γγ
t:Τζόρτζια
t:Μπουτάν
t:Τζαμάικα

l:αυ
l:ευ
l:γκ
t:αυτοκινητόδρομος
t:κοινοβουλευτικός
t:Ανγκόλα`.split("\n\n").map(x => x.split("\n"))

`l:ა
l:თ
l:ი
t:ათი

l:ე
l:რ
l:მ
t:არა
t:მერე
t:მთა

l:ბ
l:გ
l:ო
t:ორი
t:ერთი

l:დ
l:ჯ
l:ს
t:სად
t:გამარჯობა

l:ლ
l:უ
l:ქ
t:ქართული
t:გმადლობთ
t:მადლობა

l:ხ
l:ფ
l:ნ
t:დამეხმარეთ
t:ფრთხილად
t:ინგლისური

l:შ
l:ვ
l:ც
t:შორის
t:მარცხნივ
t:მარჯვნივ

l:ჰ
l:ძ
l:ჩ
t:ჰაეროვნება
t:ბრძანდებით
t:ჩრდილოეთი

l:ღ
l:ჟ
l:ზ
t:აღმოსავლეთი
t:ამჟამად
t:საზღვარი

l:პ
l:კ
l:ტ
t:პარასკევი
t:დეკემბერი
t:აეროპორტი

l:ყ
l:წ
l:ჭ
t:ყურძენი
t:წყალი
t:ჭიანჭველასებრნი`

`l:ⴰ
l:ⵣ
l:ⵓ
l:ⵍ
t:ⴰⵣⵓⵍ

l:ⵔ
l:ⵎ
l:ⵜ
t:ⴰⵣⵣⴰⵔ
t:ⴰⵔⴰⵎ
t:ⵜⴰⵎⴰⵔⵜ

l:ⴱ
l:ⵙ
l:ⵉ
t:ⴱⴰⵍⵎⴰ
t:ⵙⵎⵎⵓⵙ
t:ⵜⵓⵔⵜⵉⵜ

l:ⵡ
l:ⵛ
t:ⵜⵉⵣⵉⵣⵡⵉⵜ
t:ⵜⴰⵛⵛⵍⵜ

l:ⴳ
l:ⴷ
l:ⴹ
t:ⵉⴳⵔ
t:ⵜⵓⴳⴷⵓⵜ
t:ⴰⴳⴹⵉⴹ

l:ⴼ
l:ⴽ
l:ⵀ
t:ⴰⴼⴰⵍⴽⵓ
t:ⵜⵉⴷⴷⵓⴽⴽⵍⴰ
t:ⴰⵎⵀⴰⴷ

l:ⵃ
l:ⵄ
l:ⵅ
t:ⴰⵃⵉⴷⵓⵙ
t:ⴰⵄⵔⴰⴱ
t:ⵉⵅⴼ

l:ⴻ
l:ⵇ
l:ⵊ
t:ⵜⴰⵎⴻⴷⴷⵉⵜ
t:ⴰⵇⵛⵎⵉⵔ
t:ⴰⵊⴷⴷⵉⴳ

l:ⵏ
l:ⵕ
l:ⵖ
t:ⵜⴰⴼⵓⵏⴰⵙⵜ
t:ⴽⵕⴰⴹ
t:ⵜⴰⵎⴰⵣⵉⵖⵜ

l:ⵚ
l:ⵟ
l:ⵢ
t:ⵙⴹⵉⵚ
t:ⵜⵉⵟⵟⴰⵡⵉⵏ
t:ⵜⴰⵢⵔⵉ

l:ⵥ
l:ⵯ
t:ⵉⵕⵥⵥⵉ
t:ⴰⵎⴷⴷⴰⴽⴽⵯⵍ
t:ⵜⵉⵍⴳⴳⵯⵉⵜ`.split("\n\n").map(x => x.split("\n"))

`l:օ
l:ր
t:օր

l:պ
l:ե
l:կ
t:րոպե
t:երեկ

l:և
l:վ
l:ա
l:բ
l:ի
t:վերև
t:բիբար
t:բարև

l:ը
l:ն
l:զ
t:ինը
t:զրո

l:ու
l:թ
l:ո
l:յ
t:երկու
t:ութ
t:այո

l:տ
l:ս
l:շ
t:տասներկու
t:շատ
t:տասնյոթ

l:է
l:գ
l:դ
t:դաշտէ
t:գիշեր
t:օդակայան

l:ժ
l:լ
l:խ
t:տեսարժան
t:լոգարան
t:խոզանակ

l:ծ
l:հ
l:ձ
t:վիրավորված
t:հանգիստ
t:ձուկ

l:ղ
l:ճ
l:մ
t:մակարոնեղեն
t:նախաճաշ
t:մրսածության

l:չ
l:ջ
l:ռ
l:ց
t:տասնչորս
t:նարնջագույն
t:ռեստորաններ
t:հեռուստացույց

l:փ
l:ք
l:ֆ
t:փողոց
t:ընթրիք
t:ֆունտեր`.split("\n\n").map(x => x.split("\n"))
`l:ה
l:ַX
l:ר
l:ְX
t:הַר

l:א
l:ת
l:ָX
t:אַתְ
t:אַתָה

l:ִX
l:בּ
l:י
l:ד
t:בַּיִת
t:יָד

l:ֵX
l:ל
l:ב
t:תֵל
t:אָבִיב

l:ס
l:פ
l:נ
t:סְפָרַד
t:יַרְדֵן
t:יָוָן

l:וּ
l:מ
l:צ
t:סוּרְיָה
t:מִצְרַיִם

l:שׁ
l:ט
l:ג
t:יְרוּשָׁלַיִם
t:אַפְגָנִיסְטָן

l:וּ
l:ז
l:פּ
t:הוֹדוּ
t:בְּרָזִיל
t:פִילִיפִּינִים

l:ו
l:ֶX
l:ע
l:ק
t:טַיְוָן
t:סֶרְבְּיָה
t:עִירַאק

l:ח
l:ֻX
l:ֲX
t:שֻׁלְחַן
t:אֲסֵפָה

l:ֱX
l:ֳX
l:ֹX
t:אֱמֶת
t:צִפֳּרִים‎
t:יַהֲלוֹם
‎
l:כ
l:כּ
l:שׂ
t:כָּחֹל
t:הֲלָכָה
t:יִשְׂרָאֵל`.split("\n\n").map(x => x.split("\n"))
*/